Plan for **main** is ready.
**Branch/Commit:** refs/heads/main / 61d5192548f6da4755bc19e7a3999c98755ce4e4
**Run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/20009277475

**Plan (last ~500 lines):**
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubectl_manifest.letsencrypt will be created
  + resource "kubectl_manifest" "letsencrypt" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterIssuer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "letsencrypt-staging"
      + namespace               = "cert-manager"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt-staging
              namespace: cert-manager
            spec:
              acme:
                email: johnmonteiro78@yahoo.com
                privateKeySecretRef:
                  name: letsencrypt-staging
                server: https://acme-staging-v02.api.letsencrypt.org/directory
                solvers:
                - http01:
                    ingress:
                      ingressClassName: nginx
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.helm.helm_release.argocd["this"] is tainted, so must be replaced
-/+ resource "helm_release" "argocd" {
      ~ id                         = "argocd" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "v2.9.3"
              - chart          = "argo-cd"
              - first_deployed = 1765135752
              - last_deployed  = 1765135752
              - name           = "argocd"
              - namespace      = "argocd"
              - notes          = <<-EOT
                    In order to access the server UI you have the following options:
                    
                    1. kubectl port-forward service/argocd-server -n argocd 8080:443
                    
                        and then open the browser on http://localhost:8080 and accept the certificate
                    
                    2. enable ingress in the values file \`server.ingress.enabled\` and either
                          - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                          - Set the \`configs.params."server.insecure"\` in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                    
                    
                    After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                    
                    kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                    
                    (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://argo-cd.readthedocs.io/en/stable/getting_started/#4-login-using-the-cli)
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - configs = {
                          - params = {
                              - "server.insecure" = true
                            }
                        }
                      - global  = {
                          - domain = "argocd-prod.107363237542.montlabz.com"
                        }
                      - server  = {
                          - ingress = {
                              - annotations      = {
                                  - "cert-manager.io/cluster-issuer"            = "letsencrypt-staging"
                                  - "external-dns.alpha.kubernetes.io/hostname" = "argocd-prod.107363237542.montlabz.com"
                                  - "ingress.cilium.io/backend-service-port"    = "http"
                                  - "ingress.cilium.io/force-https"             = "disabled"
                                }
                              - enabled          = true
                              - ingressClassName = "cilium"
                              - tls              = [
                                  - {
                                      - hosts      = [
                                          - "argocd-prod.107363237542.montlabz.com",
                                        ]
                                      - secretName = "letsencrypt-staging"
                                    },
                                ]
                            }
                        }
                    }
                )
              - version        = "5.51.6"
            },
        ] -> (known after apply)
        name                       = "argocd"
      ~ status                     = "failed" -> "deployed"
        # (26 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
